Repository: cyberk1ng/bockarie
Catalog: lib/l10n/app_*.arb
Languages: de, fr, it, pt, zh

# shippoStep1
source: Sign up for carrier accounts (DHL, FedEx, UPS, etc.)
de: Registrieren Sie sich bei Carrier-Konten (DHL, FedEx, UPS usw.)
fr: Inscrivez-vous auprès des transporteurs (DHL, FedEx, UPS, etc.)
it: Registrati per account corriere (DHL, FedEx, UPS, ecc.)
pt: Registe-se em contas de transportadoras (DHL, FedEx, UPS, etc.)
zh: 注册承运商账户（DHL、FedEx、UPS 等）

# shippoStep2
source: Connect them to your Shippo account
de: Verbinden Sie diese mit Ihrem Shippo-Konto
fr: Connectez-les à votre compte Shippo
it: Collegali al tuo account Shippo
pt: Conecte-as à sua conta Shippo
zh: 将它们连接到您的 Shippo 账户

# shippoStep3
source: Update your Shippo API key in app settings
de: Aktualisieren Sie Ihren Shippo-API-Schlüssel in den App-Einstellungen
fr: Mettez à jour votre clé API Shippo dans les paramètres de l'application
it: Aggiorna la tua chiave API Shippo nelle impostazioni dell'app
pt: Atualize a sua chave API do Shippo nas configurações da aplicação
zh: 在应用设置中更新您的 Shippo API 密钥

# shippoInfoToGetRealQuotes
source: To get real shipping quotes:
de: Um echte Versandangebote zu erhalten:
fr: Pour obtenir de vrais devis d'expédition :
it: Per ottenere preventivi di spedizione reali:
pt: Para obter cotações de envio reais:
zh: 要获取真实运费报价：

# shippoInfoStep1
source: 1. Sign up for carrier accounts (DHL, FedEx, UPS)
de: 1. Registrieren Sie sich bei Carrier-Konten (DHL, FedEx, UPS)
fr: 1. Inscrivez-vous auprès des transporteurs (DHL, FedEx, UPS)
it: 1. Registrati per account corriere (DHL, FedEx, UPS)
pt: 1. Registe-se em contas de transportadoras (DHL, FedEx, UPS)
zh: 1. 注册承运商账户（DHL、FedEx、UPS）

# shippoInfoStep2
source: 2. Connect them to your Shippo account
de: 2. Verbinden Sie diese mit Ihrem Shippo-Konto
fr: 2. Connectez-les à votre compte Shippo
it: 2. Collegali al tuo account Shippo
pt: 2. Conecte-as à sua conta Shippo
zh: 2. 将它们连接到您的 Shippo 账户

# shippoInfoStep3
source: 3. Update your API key in the app settings
de: 3. Aktualisieren Sie Ihren API-Schlüssel in den App-Einstellungen
fr: 3. Mettez à jour votre clé API dans les paramètres de l'application
it: 3. Aggiorna la tua chiave API nelle impostazioni dell'app
pt: 3. Atualize a sua chave API nas configurações da aplicação
zh: 3. 在应用设置中更新您的 API 密钥

# warningNoQuotesConfigureShippo
source: Address updated! No quotes available - configure Shippo carrier accounts for real rates.
de: Adresse aktualisiert! Keine Angebote verfügbar - konfigurieren Sie Shippo-Carrier-Konten für echte Tarife.
fr: Adresse mise à jour ! Aucun devis disponible - configurez les comptes transporteurs Shippo pour les tarifs réels.
it: Indirizzo aggiornato! Nessun preventivo disponibile - configura gli account corriere Shippo per tariffe reali.
pt: Morada atualizada! Nenhuma cotação disponível - configure contas de transportadora Shippo para tarifas reais.
zh: 地址已更新！无可用报价 - 配置 Shippo 承运商账户以获取实际费率。

# warningCouldNotGenerateQuotes
source: Warning: Could not generate quotes: {error}
de: Warnung: Angebote konnten nicht erstellt werden: {error}
fr: Attention : Impossible de générer les devis : {error}
it: Avviso: Impossibile generare preventivi: {error}
pt: Aviso: Não foi possível gerar cotações: {error}
zh: 警告：无法生成报价：{error}

# optimizerCurrentPacking
source: Current Packing
de: Aktuelle Verpackung
fr: Emballage Actuel
it: Imballaggio Attuale
pt: Embalagem Atual
zh: 当前包装

# optimizerPackingSummary
source: Packing Summary
de: Packungszusammenfassung
fr: Résumé de l'Emballage
it: Riepilogo Imballaggio
pt: Resumo da Embalagem
zh: 包装摘要

# optimizerTotalCartons
source: Total Cartons
de: Gesamtkartons
fr: Total de Cartons
it: Totale Scatole
pt: Total de Caixas
zh: 总纸箱数

# optimizerActualWeight
source: Actual Weight
de: Tatsächliches Gewicht
fr: Poids Réel
it: Peso Reale
pt: Peso Real
zh: 实际重量

# optimizerDimensionalWeight
source: Dimensional Weight
de: Volumengewicht
fr: Poids Volumétrique
it: Peso Volumetrico
pt: Peso Volumétrico
zh: 体积重量

# optimizerChargeableWeight
source: Chargeable Weight
de: Abrechnungsgewicht
fr: Poids Facturable
it: Peso Tariffabile
pt: Peso Taxável
zh: 计费重量

# optimizerLargestSide
source: Largest Side
de: Größte Seite
fr: Plus Grand Côté
it: Lato Più Grande
pt: Maior Lado
zh: 最大边

# optimizerOversizeWarning
source: Oversize detected - extra fees apply
de: Übermaß erkannt - zusätzliche Gebühren fallen an
fr: Surdimension détectée - frais supplémentaires applicables
it: Dimensioni eccessive rilevate - si applicano costi aggiuntivi
pt: Sobretamanho detetado - taxas extra aplicáveis
zh: 检测到超大 - 需支付额外费用

# optimizerSuggestions
source: Optimization Suggestions
de: Optimierungsvorschläge
fr: Suggestions d'Optimisation
it: Suggerimenti di Ottimizzazione
pt: Sugestões de Otimização
zh: 优化建议

# optimizerCostSavingOpportunity
source: Cost Saving Opportunity
de: Kosteneinsparmöglichkeit
fr: Opportunité d'Économie
it: Opportunità di Risparmio sui Costi
pt: Oportunidade de Poupança
zh: 节省成本机会

# optimizerPackingOptimal
source: Packing looks optimal!
de: Packung sieht optimal aus!
fr: L'emballage semble optimal !
it: L'imballaggio sembra ottimale!
pt: Embalagem parece ótima!
zh: 包装看起来最优！

# optimizerNoSuggestions
source: Your current packing is efficient. No optimization suggestions at this time.
de: Ihre aktuelle Packung ist effizient. Derzeit keine Optimierungsvorschläge.
fr: Votre emballage actuel est efficace. Aucune suggestion d'optimisation pour le moment.
it: Il tuo imballaggio attuale è efficiente. Nessun suggerimento di ottimizzazione al momento.
pt: A sua embalagem atual é eficiente. Sem sugestões de otimização no momento.
zh: 您当前的包装很高效。目前没有优化建议。

# optimizerCartonDetails
source: Carton Details
de: Kartondetails
fr: Détails du Carton
it: Dettagli Scatola
pt: Detalhes da Caixa
zh: 纸箱详情

# optimizerDimensions
source: Dimensions: {length}×{width}×{height} cm
de: Abmessungen: {length}×{width}×{height} cm
it: Dimensioni: {length}×{width}×{height} cm
pt: Dimensões: {length}×{width}×{height} cm
zh: 尺寸：{length}×{width}×{height} 厘米

# optimizerWeight
source: Weight: {weight} kg
de: Gewicht: {weight} kg
fr: Poids : {weight} kg
it: Peso: {weight} kg
pt: Peso: {weight} kg
zh: 重量：{weight} 千克

# optimizerItem
source: Item: {type}
de: Artikel: {type}
fr: Article : {type}
it: Articolo: {type}
zh: 物品：{type}

# optimizerHelpTitle
source: Packing Optimizer
de: Packungsoptimierer
fr: Optimiseur d'Emballage
it: Ottimizzatore Imballaggio
pt: Otimizador de Embalagem
zh: 包装优化器

# optimizerHelpContent
source: The packing optimizer analyzes your cartons and suggests ways to reduce shipping costs by optimizing dimensions. Key metrics: • Actual Weight: Physical weight of items • Dimensional Weight: Calculated from carton size • Chargeable Weight: Higher of the two Tip: Reducing carton height often provides the best savings!
de: Der Packungsoptimierer analysiert Ihre Kartons und schlägt Möglichkeiten zur Reduzierung der Versandkosten durch Optimierung der Abmessungen vor. Wichtige Kennzahlen: • Tatsächliches Gewicht: Physisches Gewicht der Artikel • Volumengewicht: Berechnet aus der Kartongröße • Abrechnungsgewicht: Das höhere von beiden Tipp: Die Reduzierung der Kartonhöhe bietet oft die besten Einsparungen!
fr: L'optimiseur d'emballage analyse vos cartons et suggère des moyens de réduire les coûts d'expédition en optimisant les dimensions. Métriques clés : • Poids Réel : Poids physique des articles • Poids Volumétrique : Calculé à partir de la taille du carton • Poids Facturable : Le plus élevé des deux Astuce : Réduire la hauteur du carton offre souvent les meilleures économies !
it: L'ottimizzatore di imballaggio analizza le tue scatole e suggerisce modi per ridurre i costi di spedizione ottimizzando le dimensioni. Metriche chiave: • Peso Reale: Peso fisico degli articoli • Peso Volumetrico: Calcolato dalle dimensioni della scatola • Peso Tariffabile: Il maggiore tra i due Suggerimento: Ridurre l'altezza della scatola spesso fornisce i migliori risparmi!
pt: O otimizador de embalagem analisa as suas caixas e sugere formas de reduzir custos de envio otimizando as dimensões. Métricas principais: • Peso Real: Peso físico dos itens • Peso Volumétrico: Calculado a partir do tamanho da caixa • Peso Taxável: O maior dos dois Dica: Reduzir a altura da caixa geralmente proporciona as melhores poupanças!
zh: 包装优化器分析您的纸箱并建议通过优化尺寸来降低运输成本的方法。 关键指标： • 实际重量：物品的物理重量 • 体积重量：根据纸箱尺寸计算 • 计费重量：两者中较高的一个 提示：减少纸箱高度通常可以获得最佳节省！

# liveTotalsUpdated
source: Updated Totals (Preview)
de: Aktualisierte Summen (Vorschau)
fr: Totaux Mis à Jour (Aperçu)
it: Totali Aggiornati (Anteprima)
pt: Totais Atualizados (Pré-visualização)
zh: 更新的总计（预览）

# liveTotalsActual
source: Actual
de: Tatsächlich
fr: Réel
it: Reale
pt: Real
zh: 实际

# liveTotalsDim
source: Dim
de: Volumen
fr: Vol
it: Vol
pt: Vol
zh: 体积

# liveTotalsChargeable
source: Chargeable
de: Abrechnung
fr: Facturable
it: Tariffabile
pt: Taxável
zh: 计费

# liveTotalsInfoNote
source: Dim Weight = (L×W×H)/5000, Chargeable = max(Actual, Dim) × Qty. Click "Recalculate Quotes" to fetch real shipping rates from Shippo API.
de: Volumengewicht = (L×B×H)/5000, Abrechnungsgewicht = max(Tatsächlich, Volumen) × Menge. Klicken Sie auf "Angebote neu berechnen", um echte Versandtarife von der Shippo-API abzurufen.
fr: Poids Vol = (L×l×H)/5000, Facturable = max(Réel, Vol) × Qté. Cliquez sur "Recalculer les Devis" pour obtenir les vrais tarifs d'expédition depuis l'API Shippo.
it: Peso Vol = (L×L×A)/5000, Tariffabile = max(Reale, Vol) × Qtà. Clicca "Ricalcola Preventivi" per ottenere tariffe di spedizione reali dall'API Shippo.
pt: Peso Vol = (C×L×A)/5000, Taxável = máx(Real, Vol) × Qtd. Clique em "Recalcular Cotações" para obter tarifas de envio reais da API Shippo.
zh: 体积重量 = (长×宽×高)/5000，计费重量 = max(实际,体积) × 数量。点击"重新计算报价"从 Shippo API 获取实际运费。

# liveTotalsOversizeWarning
source: Oversize - extra fees may apply
de: Übermaß - zusätzliche Gebühren können anfallen
fr: Surdimension - des frais supplémentaires peuvent s'appliquer
it: Dimensioni eccessive - possono applicarsi costi aggiuntivi
pt: Sobretamanho - taxas extra podem aplicar-se
zh: 超大 - 可能收取额外费用

# transportExpressAir
source: Express Air
de: Express-Luftfracht
fr: Aérien Express
it: Aereo Espresso
pt: Aéreo Expresso
zh: 航空快递

# transportStandardAir
source: Standard Air
de: Standard-Luftfracht
fr: Aérien Standard
it: Aereo Standard
pt: Aéreo Padrão
zh: 标准航空

# transportAirFreight
source: Air Freight
de: Luftfracht
fr: Fret Aérien
it: Trasporto Aereo
pt: Frete Aéreo
zh: 航空货运

# transportSeaFreightLCL
source: Sea Freight (LCL)
de: Seefracht (LCL)
fr: Fret Maritime (LCL)
it: Trasporto Marittimo (LCL)
pt: Frete Marítimo (LCL)
zh: 海运拼箱（LCL）

# transportSeaFreightFCL
source: Sea Freight (FCL)
de: Seefracht (FCL)
fr: Fret Maritime (FCL)
it: Trasporto Marittimo (FCL)
pt: Frete Marítimo (FCL)
zh: 海运整柜（FCL）

# transportRoadFreight
source: Road Freight
de: Straßenfracht
fr: Fret Routier
it: Trasporto su Strada
pt: Frete Rodoviário
zh: 公路货运

# transportOptionsCount
source: {count} {count, plural, =1{option} other{options}}
de: {count} {count, plural, =1{Option} other{Optionen}}
it: {count} {count, plural, =1{opzione} other{opzioni}}
pt: {count} {count, plural, =1{opção} other{opções}}
zh: {count} 个{count, plural, =1{选项} other{选项}}

# etaDays
source: {min}-{max} days
de: {min}-{max} Tage
fr: {min}-{max} jours
it: {min}-{max} giorni
pt: {min}-{max} dias
zh: {min}-{max} 天

# etaSingleDay
source: {days} days
de: {days} Tage
fr: {days} jours
it: {days} giorni
pt: {days} dias
zh: {days} 天

# priceFrom
source: from {price}
de: ab {price}
fr: à partir de {price}
it: da {price}
pt: a partir de {price}
zh: 起价 {price}

# cheapestPrice
source: {weight} kg • from {price}
de: {weight} kg • ab {price}
fr: {weight} kg • à partir de {price}
it: {weight} kg • da {price}
pt: {weight} kg • a partir de {price}
zh: {weight} 千克 • 起价 {price}

# versionDisplay
source: Bockarie v{version} ({buildNumber})
it: Bockaire v{version} ({buildNumber})
zh: Bockaire v{version} ({buildNumber})

# cheapestPriceChange
source: Cheapest: {oldPrice} → {newPrice}
de: Günstigster: {oldPrice} → {newPrice}
fr: Le moins cher : {oldPrice} → {newPrice}
it: Più economico: {oldPrice} → {newPrice}
pt: Mais barato: {oldPrice} → {newPrice}
zh: 最便宜：{oldPrice} → {newPrice}

source: Instant Quotes
fr: Devis Instantanés
it: Preventivi Istantanei
pt: Cotações Instantâneas

# chargeableWeightDisplay
source: {weight} kg chargeable
fr: {weight} kg facturable
it: {weight} kg tariffabile
pt: {weight} kg taxável

# badgeCheapestShort
source: Cheapest
fr: Le Moins Cher
it: Più Economico
pt: Mais Barato

# badgeFastestShort
source: Fastest
fr: Le Plus Rapide
it: Più Veloce
pt: Mais Rápido

# badgeBestValue
source: Best Value
fr: Meilleur Rapport Qualité-Prix
it: Miglior Rapporto Qualità-Prezzo
pt: Melhor Valor

# quoteSubtotal
source: Subtotal
fr: Sous-total
it: Subtotale

# quoteFuelSurcharge
source: Fuel Surcharge
fr: Supplément Carburant
it: Supplemento Carburante
pt: Taxa de Combustível

# quoteOversizeFee
source: Oversize Fee
fr: Frais de Surdimension
it: Tariffa Dimensioni Eccessive
pt: Taxa de Sobretamanho

# optimizationFoundTitle
source: Optimization Found!
fr: Optimisation Trouvée !
it: Ottimizzazione Trovata!
pt: Otimização Encontrada!

# fewerCartons
source: {count} fewer carton(s)
fr: {count} carton(s) en moins
it: {count} scatola/e in meno
pt: {count} caixa(s) a menos

# lessChargeableWeight
source: {weight} kg less chargeable weight
fr: {weight} kg de poids facturable en moins
it: {weight} kg in meno di peso tariffabile
pt: {weight} kg de peso taxável a menos

# currentPackingOptimal
source: Current packing is already optimal
fr: L'emballage actuel est déjà optimal
it: L'imballaggio attuale è già ottimale
pt: Embalagem atual já está otimizada

# comparisonCurrent
source: Current
fr: Actuel
it: Attuale
pt: Atual

# comparisonOptimized
source: Optimized
fr: Optimisé
it: Ottimizzato
pt: Otimizado

# statCartons
source: Cartons
it: Scatole
pt: Caixas

# statChargeable
source: Chargeable
fr: Facturable
it: Tariffabile
pt: Taxável

# buttonApplyOptimization
source: Apply Optimization
fr: Appliquer l'Optimisation
it: Applica Ottimizzazione
pt: Aplicar Otimização

# buttonKeepOriginal
source: Keep Original
fr: Garder l'Original
it: Mantieni Originale
pt: Manter Original

# buttonClose
source: Close
fr: Fermer
it: Chiudi
pt: Fechar

# helperSelectFromDropdown
source: Please select a city from the dropdown
fr: Veuillez sélectionner une ville dans la liste déroulante
it: Seleziona una città dal menu a discesa
pt: Por favor selecione uma cidade da lista suspensa

# validationSelectFromDropdown
source: Please select a city from the dropdown
fr: Veuillez sélectionner une ville dans la liste déroulante
it: Seleziona una città dal menu a discesa
pt: Por favor selecione uma cidade da lista suspensa

# navHome
source: Home
de: Startseite
fr: Accueil
pt: Início
zh: 首页

# languageMaltese
source: Maltese
fr: Maltais
pt: Maltês

# settingsCurrencyTitle
source: Currency
de: Währung
zh: 货币

# settingsCurrencySubtitle
source: Select display currency
de: Anzeigewährung auswählen
zh: 选择显示货币

# currencyEuro
source: Euro
zh: 欧元

# currencyUsd
source: US Dollar
zh: 美元

# currencyGbp
source: British Pound
de: Britisches Pfund
zh: 英镑

source: {weight} kg
zh: {weight} 千克
