Repository: cyberk1ng/bockarie
Catalog: lib/l10n/app_*.arb
Languages: de, fr, it, pt, zh

# appTitle
source: Bockarie
it: Bockaire
zh: Bockaire

# navNewShipment
source: New Shipment
de: Neue Sendung
fr: Nouvel Envoi
it: Nuova Spedizione
pt: Novo Envio
zh: 新货运

# navSettings
source: Settings
de: Einstellungen
fr: Paramètres
it: Impostazioni
pt: Configurações
zh: 设置

# settingsTitle
source: Settings
de: Einstellungen
fr: Paramètres
it: Impostazioni
pt: Configurações
zh: 设置

# settingsAppearance
source: Appearance
de: Erscheinungsbild
fr: Apparence
it: Aspetto
pt: Aparência
zh: 外观

# settingsThemeMode
source: Theme Mode
de: Designmodus
fr: Mode Thème
it: Modalità Tema
pt: Modo de Tema
zh: 主题模式

# settingsThemeLightTooltip
source: Light Mode
de: Heller Modus
fr: Mode Clair
it: Modalità Chiara
pt: Modo Claro
zh: 浅色模式

# settingsThemeSystemTooltip
source: System Default
de: Systemstandard
fr: Défaut Système
it: Predefinito di Sistema
pt: Padrão do Sistema
zh: 系统默认

# settingsThemeDarkTooltip
source: Dark Mode
de: Dunkler Modus
fr: Mode Sombre
it: Modalità Scura
pt: Modo Escuro
zh: 深色模式

# settingsConfiguration
source: Configuration
de: Konfiguration
it: Configurazione
pt: Configuração
zh: 配置

# settingsRateTables
source: Rate Tables
de: Tariftabellen
fr: Grilles Tarifaires
it: Tabelle Tariffe
pt: Tabelas de Tarifas
zh: 费率表

# settingsRateTablesSubtitle
source: Manage carrier rates
de: Transporttarife verwalten
fr: Gérer les tarifs transporteurs
it: Gestisci le tariffe dei corrieri
pt: Gerir tarifas de transportadoras
zh: 管理承运商费率

# settingsAiProviders
source: AI Providers
de: KI-Anbieter
fr: Fournisseurs IA
it: Fornitori IA
pt: Fornecedores de IA
zh: AI 提供商

# settingsAiProvidersSubtitle
source: Configure AI models
de: KI-Modelle konfigurieren
fr: Configurer les modèles IA
it: Configura i modelli IA
pt: Configurar modelos de IA
zh: 配置 AI 模型

# settingsAbout
source: About
de: Über
fr: À propos
it: Informazioni
pt: Sobre
zh: 关于

# settingsLanguageTitle
source: Language
de: Sprache
fr: Langue
it: Lingua
pt: Idioma
zh: 语言

# settingsLanguageSubtitle
source: Select app language
de: App-Sprache auswählen
fr: Sélectionner la langue de l'application
it: Seleziona la lingua dell'app
pt: Selecionar idioma da aplicação
zh: 选择应用语言

# languageEnglish
source: English
de: Englisch
fr: Anglais
it: Inglese
pt: Inglês
zh: 英语

# languageGerman
source: German
de: Deutsch
fr: Allemand
it: Tedesco
pt: Alemão
zh: 德语

# languageChinese
source: Chinese
de: Chinesisch
fr: Chinois
it: Cinese
pt: Chinês
zh: 中文

# languageFrench
source: French
fr: Français
it: Francese
pt: Francês

# languageSpanish
source: Spanish
fr: Espagnol
it: Spagnolo
pt: Espanhol

# languageItalian
source: Italian
fr: Italien
it: Italiano
pt: Italiano

# languagePortuguese
source: Portuguese
fr: Portugais
it: Portoghese
pt: Português

# languageDutch
source: Dutch
fr: Néerlandais
it: Olandese
pt: Holandês

# languagePolish
source: Polish
fr: Polonais
it: Polacco
pt: Polaco

# languageGreek
source: Greek
fr: Grec
it: Greco
pt: Grego

# languageCzech
source: Czech
fr: Tchèque
it: Ceco
pt: Checo

# languageHungarian
source: Hungarian
fr: Hongrois
it: Ungherese
pt: Húngaro

# languageRomanian
source: Romanian
fr: Roumain
it: Rumeno
pt: Romeno

# languageSwedish
source: Swedish
fr: Suédois
it: Svedese
pt: Sueco

# languageDanish
source: Danish
fr: Danois
it: Danese
pt: Dinamarquês

# languageFinnish
source: Finnish
fr: Finnois
it: Finlandese
pt: Finlandês

# languageSlovak
source: Slovak
fr: Slovaque
it: Slovacco
pt: Eslovaco

# languageBulgarian
source: Bulgarian
fr: Bulgare
it: Bulgaro
pt: Búlgaro

# languageCroatian
source: Croatian
fr: Croate
it: Croato
pt: Croata

# languageLithuanian
source: Lithuanian
fr: Lituanien
it: Lituano
pt: Lituano

# languageLatvian
source: Latvian
fr: Letton
it: Lettone
pt: Letão

# languageSlovenian
source: Slovenian
fr: Slovène
it: Sloveno
pt: Esloveno

# languageEstonian
source: Estonian
fr: Estonien
it: Estone
pt: Estoniano

# languageIrish
source: Irish
fr: Irlandais
it: Irlandese
pt: Irlandês

# languageArabic
source: Arabic
fr: Arabe
it: Arabo
pt: Árabe

# languageTurkish
source: Turkish
fr: Turc
it: Turco
pt: Turco

# languageHebrew
source: Hebrew
fr: Hébreu
it: Ebraico
pt: Hebraico

# languagePersian
source: Persian
fr: Persan
it: Persiano
pt: Persa

# systemDefaultLanguage
source: System Default
de: Systemstandard
fr: Défaut Système
it: Predefinito di Sistema
pt: Padrão do Sistema
zh: 系统默认

# searchHint
source: Search languages...
de: Sprachen durchsuchen...
fr: Rechercher des langues...
it: Cerca lingue...
pt: Pesquisar idiomas...
zh: 搜索语言...

# titleRecentShipments
source: Recent Shipments
de: Letzte Sendungen
fr: Envois Récents
it: Spedizioni Recenti
pt: Envios Recentes
zh: 最近货运

# titleNewShipment
source: New Shipment
de: Neue Sendung
fr: Nouvel Envoi
it: Nuova Spedizione
pt: Novo Envio
zh: 新货运

# titleShipmentDetails
source: Shipment Details
de: Sendungsdetails
fr: Détails de l'Envoi
it: Dettagli Spedizione
pt: Detalhes do Envio
zh: 货运详情

# titleShippingQuotes
source: Shipping Quotes
de: Versandangebote
fr: Devis d'Expédition
it: Preventivi di Spedizione
pt: Cotações de Envio
zh: 运费报价

# titleAvailableQuotes
source: Available Quotes
de: Verfügbare Angebote
fr: Devis Disponibles
it: Preventivi Disponibili
pt: Cotações Disponíveis
zh: 可用报价

# titleQuoteComparison
source: Quote Comparison
de: Angebotsvergleich
fr: Comparaison de Devis
it: Confronto Preventivi
pt: Comparação de Cotações
zh: 报价比较

# titlePackingOptimizer
source: Packing Optimizer
de: Packungsoptimierer
fr: Optimiseur d'Emballage
it: Ottimizzatore Imballaggio
pt: Otimizador de Embalagem
zh: 包装优化器

# emptyStateNoShipments
source: No shipments yet
de: Noch keine Sendungen
fr: Aucun envoi pour le moment
it: Nessuna spedizione ancora
pt: Ainda sem envios
zh: 还没有货运

# emptyStateCreateFirst
source: Create your first shipment to get started
de: Erstellen Sie Ihre erste Sendung, um zu beginnen
fr: Créez votre premier envoi pour commencer
it: Crea la tua prima spedizione per iniziare
pt: Crie o seu primeiro envio para começar
zh: 创建您的第一个货运以开始

# emptyStateNoQuotes
source: No Shipping Quotes Available
de: Keine Versandangebote verfügbar
fr: Aucun Devis d'Expédition Disponible
it: Nessun Preventivo di Spedizione Disponibile
pt: Nenhuma Cotação de Envio Disponível
zh: 无可用运费报价

# labelFrom
source: From
de: Von
fr: De
it: Da
pt: De
zh: 发件地

# labelTo
source: To
de: Nach
fr: À
it: A
pt: Para
zh: 收件地

# labelOriginCity
source: Origin City
de: Ursprungsort
fr: Ville d'Origine
it: Città di Origine
pt: Cidade de Origem
zh: 始发城市

# labelOriginPostal
source: Origin Postal
de: Ursprungs-PLZ
fr: Code Postal d'Origine
it: CAP di Origine
pt: Código Postal de Origem
zh: 始发邮编

# labelDestinationCity
source: Destination City
de: Zielort
fr: Ville de Destination
it: Città di Destinazione
pt: Cidade de Destino
zh: 目的城市

# labelDestinationPostal
source: Destination Postal
de: Ziel-PLZ
fr: Code Postal de Destination
it: CAP di Destinazione
pt: Código Postal de Destino
zh: 目的邮编

# labelPostalCode
source: Postal Code
de: Postleitzahl
fr: Code Postal
it: Codice Postale
pt: Código Postal
zh: 邮政编码

# labelCountry
source: Country
de: Land
fr: Pays
it: Paese
pt: País
zh: 国家

# labelState
source: State
de: Bundesland
fr: État
it: Stato
pt: Estado
zh: 州/省

# labelCity
source: City
de: Stadt
fr: Ville
it: Città
pt: Cidade
zh: 城市

# labelNotes
source: Notes (optional)
de: Notizen (optional)
fr: Notes (optionnel)
it: Note (opzionale)
pt: Notas (opcional)
zh: 备注（可选）

# labelCartons
source: Cartons
de: Kartons
it: Scatole
pt: Caixas
zh: 纸箱

# labelWeight
source: Weight
de: Gewicht
fr: Poids
it: Peso
pt: Peso
zh: 重量

# labelLength
source: Length (cm)
de: Länge (cm)
fr: Longueur (cm)
it: Lunghezza (cm)
pt: Comprimento (cm)
zh: 长度（厘米）

# labelWidth
source: Width (cm)
de: Breite (cm)
fr: Largeur (cm)
it: Larghezza (cm)
pt: Largura (cm)
zh: 宽度（厘米）

# labelHeight
source: Height (cm)
de: Höhe (cm)
fr: Hauteur (cm)
it: Altezza (cm)
pt: Altura (cm)
zh: 高度（厘米）

# labelWeightKg
source: Weight (kg)
de: Gewicht (kg)
fr: Poids (kg)
it: Peso (kg)
pt: Peso (kg)
zh: 重量（千克）

# labelQuantity
source: Quantity
de: Menge
fr: Quantité
it: Quantità
pt: Quantidade
zh: 数量

# labelItemType
source: Item Type
de: Artikeltyp
fr: Type d'Article
it: Tipo di Articolo
pt: Tipo de Item
zh: 物品类型

# labelCartonNumber
source: Carton {number}
de: Karton {number}
it: Scatola {number}
pt: Caixa {number}
zh: 纸箱 {number}

# buttonSave
source: Save
de: Speichern
fr: Enregistrer
it: Salva
pt: Guardar
zh: 保存

# buttonCancel
source: Cancel
de: Abbrechen
fr: Annuler
it: Annulla
pt: Cancelar
zh: 取消

# buttonDelete
source: Delete
de: Löschen
fr: Supprimer
it: Elimina
pt: Eliminar
zh: 删除

# buttonAddCarton
source: Add Carton
de: Karton hinzufügen
fr: Ajouter un Carton
it: Aggiungi Scatola
pt: Adicionar Caixa
zh: 添加纸箱

# buttonSaveShipment
source: Save Shipment
de: Sendung speichern
fr: Enregistrer l'Envoi
it: Salva Spedizione
pt: Guardar Envio
zh: 保存货运

# buttonViewQuotes
source: View Quotes
de: Angebote ansehen
fr: Voir les Devis
it: Visualizza Preventivi
pt: Ver Cotações
zh: 查看报价

# buttonOptimize
source: Optimize
de: Optimieren
fr: Optimiser
it: Ottimizza
pt: Otimizar
zh: 优化

# buttonBookThis
source: Book This
de: Buchen
fr: Réserver Ceci
it: Prenota Questo
pt: Reservar Este
zh: 预订此项

# buttonDetails
source: Details
fr: Détails
it: Dettagli
pt: Detalhes
zh: 详情

# buttonLess
source: Less
de: Weniger
fr: Moins
it: Meno
pt: Menos
zh: 收起

# buttonBook
source: Book
de: Buchen
fr: Réserver
it: Prenota
pt: Reservar
zh: 预订

# buttonDiscard
source: Discard
de: Verwerfen
fr: Abandonner
it: Scarta
pt: Descartar
zh: 放弃

# buttonSaveChanges
source: Save Changes
de: Änderungen speichern
fr: Enregistrer les Modifications
it: Salva Modifiche
pt: Guardar Alterações
zh: 保存更改

# buttonGotIt
source: Got it
de: Verstanden
fr: Compris
it: Capito
pt: Entendi
zh: 明白了

# buttonResetToOriginal
source: Reset to Original
de: Auf Original zurücksetzen
fr: Réinitialiser à l'Original
it: Ripristina Originale
pt: Repor Original
zh: 重置为原始

# buttonRecalculateQuotes
source: Recalculate Quotes
de: Angebote neu berechnen
fr: Recalculer les Devis
it: Ricalcola Preventivi
pt: Recalcular Cotações
zh: 重新计算报价

# buttonApplySuggestion
source: Apply Suggestion
de: Vorschlag anwenden
fr: Appliquer la Suggestion
it: Applica Suggerimento
pt: Aplicar Sugestão
zh: 应用建议

# actionExportPdf
source: Export PDF
de: PDF exportieren
fr: Exporter en PDF
it: Esporta PDF
pt: Exportar PDF
zh: 导出 PDF

# actionOptimizePacking
source: Optimize Packing
de: Packung optimieren
fr: Optimiser l'Emballage
it: Ottimizza Imballaggio
pt: Otimizar Embalagem
zh: 优化包装

# tooltipBack
source: Back
de: Zurück
fr: Retour
it: Indietro
pt: Voltar
zh: 返回

# tooltipHelp
source: Help
de: Hilfe
fr: Aide
it: Aiuto
pt: Ajuda
zh: 帮助

# tooltipSort
source: Sort
de: Sortieren
fr: Trier
it: Ordina
pt: Ordenar
zh: 排序

# tooltipListView
source: List View
de: Listenansicht
fr: Vue Liste
it: Vista Elenco
pt: Vista de Lista
zh: 列表视图

# tooltipGroupByTransportMethod
source: Group by Transport Method
de: Nach Transportart gruppieren
fr: Grouper par Mode de Transport
it: Raggruppa per Metodo di Trasporto
pt: Agrupar por Método de Transporte
zh: 按运输方式分组

# hintClickToEdit
source: Click to edit
de: Zum Bearbeiten klicken
fr: Cliquer pour modifier
it: Clicca per modificare
pt: Clique para editar
zh: 点击编辑

# validationRequired
source: Required
de: Erforderlich
fr: Requis
it: Obbligatorio
pt: Obrigatório
zh: 必填

# validationInvalid
source: Invalid
de: Ungültig
fr: Invalide
it: Non valido
pt: Inválido
zh: 无效

# errorAddCartons
source: Please add at least one carton
de: Bitte fügen Sie mindestens einen Karton hinzu
fr: Veuillez ajouter au moins un carton
it: Aggiungi almeno una scatola
pt: Por favor adicione pelo menos uma caixa
zh: 请至少添加一个纸箱

source: Error saving shipment
de: Fehler beim Speichern der Sendung
fr: Erreur lors de l'enregistrement de l'envoi
it: Errore nel salvare la spedizione
pt: Erro ao guardar envio
zh: 保存货运出错

source: Error loading shipments
de: Fehler beim Laden der Sendungen
fr: Erreur lors du chargement des envois
it: Errore nel caricare le spedizioni
pt: Erro ao carregar envios
zh: 加载货运出错

source: Error loading cartons
de: Fehler beim Laden der Kartons
fr: Erreur lors du chargement des cartons
it: Errore nel caricare le scatole
pt: Erro ao carregar caixas
zh: 加载纸箱出错

source: Error updating address
de: Fehler beim Aktualisieren der Adresse
fr: Erreur lors de la mise à jour de l'adresse
it: Errore nell'aggiornare l'indirizzo
pt: Erro ao atualizar morada
zh: 更新地址出错

source: Error exporting PDF
de: Fehler beim Exportieren der PDF
fr: Erreur lors de l'exportation PDF
it: Errore nell'esportare il PDF
pt: Erro ao exportar PDF
zh: 导出 PDF 出错

# errorRecalculating
source: Error recalculating quotes
de: Fehler bei der Neuberechnung der Angebote
fr: Erreur lors du recalcul des devis
it: Errore nel ricalcolare i preventivi
pt: Erro ao recalcular cotações
zh: 重新计算报价出错

source: Error saving changes
de: Fehler beim Speichern der Änderungen
fr: Erreur lors de l'enregistrement des modifications
it: Errore nel salvare le modifiche
pt: Erro ao guardar alterações
zh: 保存更改出错

source: Error deleting shipment
de: Fehler beim Löschen der Sendung
fr: Erreur lors de la suppression de l'envoi
it: Errore nell'eliminare la spedizione
pt: Erro ao eliminar envio
zh: 删除货运出错

# errorApplySuggestion
source: Error applying suggestion
de: Fehler beim Anwenden des Vorschlags
fr: Erreur lors de l'application de la suggestion
it: Errore nell'applicare il suggerimento
pt: Erro ao aplicar sugestão
zh: 应用建议出错

# successShipmentSaved
source: Shipment saved successfully
de: Sendung erfolgreich gespeichert
fr: Envoi enregistré avec succès
it: Spedizione salvata con successo
pt: Envio guardado com sucesso
zh: 货运已成功保存

# successShipmentDeleted
source: Shipment deleted successfully
de: Sendung erfolgreich gelöscht
fr: Envoi supprimé avec succès
it: Spedizione eliminata con successo
pt: Envio eliminado com sucesso
zh: 货运已成功删除

# successPdfExported
source: PDF exported successfully
de: PDF erfolgreich exportiert
fr: PDF exporté avec succès
it: PDF esportato con successo
pt: PDF exportado com sucesso
zh: PDF 已成功导出

# successChangesSaved
source: Changes saved! Quotes updated.
de: Änderungen gespeichert! Angebote aktualisiert.
fr: Modifications enregistrées ! Devis mis à jour.
it: Modifiche salvate! Preventivi aggiornati.
pt: Alterações guardadas! Cotações atualizadas.
zh: 更改已保存！报价已更新。

# successAddressUpdated
source: Address updated! {count} quotes generated.
de: Adresse aktualisiert! {count} Angebote erstellt.
fr: Adresse mise à jour ! {count} devis générés.
it: Indirizzo aggiornato! {count} preventivi generati.
pt: Morada atualizada! {count} cotações geradas.
zh: 地址已更新！已生成 {count} 个报价。

# successOptimizationApplied
source: Optimization applied! Quotes have been recalculated.
de: Optimierung angewendet! Angebote wurden neu berechnet.
fr: Optimisation appliquée ! Les devis ont été recalculés.
it: Ottimizzazione applicata! I preventivi sono stati ricalcolati.
pt: Otimização aplicada! As cotações foram recalculadas.
zh: 优化已应用！报价已重新计算。

# statusCalculatingQuotes
source: Calculating quotes...
de: Angebote werden berechnet...
fr: Calcul des devis...
it: Calcolo preventivi in corso...
pt: A calcular cotações...
zh: 正在计算报价...

# statusLoading
source: Loading...
de: Lädt...
fr: Chargement...
it: Caricamento...
pt: A carregar...
zh: 加载中...

# statusSavingShipment
source: Saving shipment and generating quotes...
de: Sendung speichern und Angebote erstellen...
fr: Enregistrement de l'envoi et génération des devis...
it: Salvataggio spedizione e generazione preventivi...
pt: A guardar envio e gerar cotações...
zh: 正在保存货运并生成报价...

# statusNoQuotesAvailable
source: No quotes available
de: Keine Angebote verfügbar
fr: Aucun devis disponible
it: Nessun preventivo disponibile
pt: Nenhuma cotação disponível
zh: 无可用报价

# deleteShipmentTitle
source: Delete Shipment
de: Sendung löschen
fr: Supprimer l'Envoi
it: Elimina Spedizione
pt: Eliminar Envio
zh: 删除货运

# deleteShipmentMessage
source: Are you sure you want to delete the shipment from {origin} to {destination}?
de: Möchten Sie die Sendung von {origin} nach {destination} wirklich löschen?
fr: Êtes-vous sûr de vouloir supprimer l'envoi de {origin} vers {destination} ?
it: Sei sicuro di voler eliminare la spedizione da {origin} a {destination}?
pt: Tem a certeza que deseja eliminar o envio de {origin} para {destination}?
zh: 您确定要删除从 {origin} 到 {destination} 的货运吗？

# bookShipmentTitle
source: Book Shipment
de: Sendung buchen
fr: Réserver l'Envoi
it: Prenota Spedizione
pt: Reservar Envio
zh: 预订货运

# bookShipmentMessage
source: Book shipment with {carrier} {service}?
de: Sendung mit {carrier} {service} buchen?
fr: Réserver l'envoi avec {carrier} {service} ?
it: Prenotare spedizione con {carrier} {service}?
pt: Reservar envio com {carrier} {service}?
zh: 使用 {carrier} {service} 预订货运？

source: Booking feature coming soon!
de: Buchungsfunktion kommt bald!
fr: Fonctionnalité de réservation bientôt disponible !
it: Funzionalità di prenotazione in arrivo!
pt: Funcionalidade de reserva em breve!
zh: 预订功能即将推出！

# editOriginTitle
source: Edit Origin
de: Ursprung bearbeiten
fr: Modifier l'Origine
it: Modifica Origine
pt: Editar Origem
zh: 编辑始发地

# editDestinationTitle
source: Edit Destination
de: Ziel bearbeiten
fr: Modifier la Destination
it: Modifica Destinazione
pt: Editar Destino
zh: 编辑目的地

# editDimensionsTitle
source: Edit Dimensions
de: Abmessungen bearbeiten
fr: Modifier les Dimensions
it: Modifica Dimensioni
pt: Editar Dimensões
zh: 编辑尺寸

# editDimensionsSubtitle
source: Experiment with different packing configurations
de: Experimentieren Sie mit verschiedenen Packkonfigurationen
fr: Expérimentez avec différentes configurations d'emballage
it: Sperimenta con diverse configurazioni di imballaggio
pt: Experimente diferentes configurações de embalagem
zh: 尝试不同的包装配置

# autoFillNote
source: Country, state, and postal code will be auto-filled when you select a city
de: Land, Bundesland und Postleitzahl werden automatisch ausgefüllt, wenn Sie eine Stadt auswählen
fr: Le pays, l'état et le code postal seront remplis automatiquement lorsque vous sélectionnez une ville
it: Paese, stato e codice postale verranno compilati automaticamente quando selezioni una città
pt: País, estado e código postal serão preenchidos automaticamente quando selecionar uma cidade
zh: 选择城市后，国家、州/省和邮政编码将自动填充

# sortPriceLowHigh
source: Price: Low to High
de: Preis: Niedrig bis Hoch
fr: Prix : Du Plus Bas au Plus Élevé
it: Prezzo: Dal Più Basso al Più Alto
pt: Preço: Mais Baixo ao Mais Alto
zh: 价格：从低到高

# sortPriceHighLow
source: Price: High to Low
de: Preis: Hoch bis Niedrig
fr: Prix : Du Plus Élevé au Plus Bas
it: Prezzo: Dal Più Alto al Più Basso
pt: Preço: Mais Alto ao Mais Baixo
zh: 价格：从高到低

# sortSpeedFastest
source: Speed: Fastest First
de: Geschwindigkeit: Schnellste zuerst
fr: Vitesse : Le Plus Rapide en Premier
it: Velocità: Più Veloce Prima
pt: Velocidade: Mais Rápido Primeiro
zh: 速度：最快优先

# sortSpeedSlowest
source: Speed: Slowest First
de: Geschwindigkeit: Langsamste zuerst
fr: Vitesse : Le Plus Lent en Premier
it: Velocità: Più Lento Prima
pt: Velocidade: Mais Lento Primeiro
zh: 速度：最慢优先

# filterAll
source: All
de: Alle
fr: Tous
it: Tutti
pt: Todos
zh: 全部

# badgeCheapest
source: CHEAPEST
de: GÜNSTIGSTER
fr: LE MOINS CHER
it: PIÙ ECONOMICO
pt: MAIS BARATO
zh: 最便宜

# badgeFastest
source: FASTEST
de: SCHNELLSTER
fr: LE PLUS RAPIDE
it: PIÙ VELOCE
pt: MAIS RÁPIDO
zh: 最快

# badgeBestInCategory
source: BEST IN CATEGORY
de: BESTER IN KATEGORIE
fr: MEILLEUR DE LA CATÉGORIE
it: MIGLIORE DELLA CATEGORIA
pt: MELHOR DA CATEGORIA
zh: 类别最佳

# quoteDetailsPriceBreakdown
source: Price Breakdown
de: Preisaufschlüsselung
fr: Détail des Prix
it: Dettaglio Prezzi
pt: Detalhamento de Preços
zh: 价格明细

# quoteDetailsChargeableWeight
source: Chargeable Weight
de: Abrechnungsgewicht
fr: Poids Facturable
it: Peso Tariffabile
pt: Peso Taxável
zh: 计费重量

# quoteDetailsTotalPrice
source: Total Price
de: Gesamtpreis
fr: Prix Total
it: Prezzo Totale
pt: Preço Total
zh: 总价

# quoteComparisonPotentialSavings
source: Potential Savings!
de: Mögliche Einsparungen!
fr: Économies Potentielles !
it: Risparmi Potenziali!
pt: Poupança Potencial!
zh: 可能节省！

# quoteComparisonCostIncrease
source: Cost Increase
de: Kostenerhöhung
fr: Augmentation du Coût
it: Aumento del Costo
pt: Aumento de Custo
zh: 成本增加

# quoteComparisonNoChange
source: No Change
de: Keine Änderung
fr: Aucun Changement
it: Nessun Cambiamento
pt: Sem Alteração
zh: 无变化

# quoteComparisonAvailableQuotes
source: Available Quotes ({count})
de: Verfügbare Angebote ({count})
fr: Devis Disponibles ({count})
it: Preventivi Disponibili ({count})
pt: Cotações Disponíveis ({count})
zh: 可用报价（{count}）

# quoteComparisonNoQuotesAvailable
source: No Quotes Available
de: Keine Angebote verfügbar
fr: Aucun Devis Disponible
it: Nessun Preventivo Disponibile
pt: Nenhuma Cotação Disponível
zh: 无可用报价

# shippoTestLimitationMessage
source: Shippo test API keys don't support this shipping route. Test carrier accounts typically only work for US domestic or China-to-US routes. To get real rates for this route, you need to: • Switch to live Shippo API keys • Connect real carrier accounts (UPS, DHL, FedEx, etc.)
de: Shippo-Test-API-Schlüssel unterstützen diese Versandroute nicht. Test-Carrier-Konten funktionieren normalerweise nur für US-Inlandsversand oder China-USA-Routen. Um echte Tarife für diese Route zu erhalten, müssen Sie: • Auf Live-Shippo-API-Schlüssel umstellen • Echte Carrier-Konten verbinden (UPS, DHL, FedEx usw.)
fr: Les clés API de test Shippo ne prennent pas en charge cette route d'expédition. Les comptes transporteurs de test ne fonctionnent généralement que pour les routes domestiques US ou Chine vers US. Pour obtenir des tarifs réels pour cette route, vous devez : • Passer aux clés API Shippo en direct • Connecter de vrais comptes transporteurs (UPS, DHL, FedEx, etc.)
it: Le chiavi API di test di Shippo non supportano questa rotta di spedizione. Gli account corriere di test generalmente funzionano solo per rotte domestiche USA o Cina-USA. Per ottenere tariffe reali per questa rotta, devi: • Passare alle chiavi API Shippo live • Collegare account corriere reali (UPS, DHL, FedEx, ecc.)
pt: As chaves API de teste do Shippo não suportam esta rota de envio. As contas de transportadora de teste geralmente funcionam apenas para rotas domésticas dos EUA ou China-EUA. Para obter tarifas reais para esta rota, precisa de: • Mudar para chaves API do Shippo ao vivo • Conectar contas de transportadoras reais (UPS, DHL, FedEx, etc.)
zh: Shippo 测试 API 密钥不支持此运输路线。 测试承运商账户通常仅适用于美国国内或中国到美国的路线。 要获取此路线的实际费率，您需要： • 切换到实时 Shippo API 密钥 • 连接真实的承运商账户（UPS、DHL、FedEx 等）

# shippoTestLimitationShort
source: Shippo's free test carrier accounts don't support international shipments from China.
de: Die kostenlosen Test-Carrier-Konten von Shippo unterstützen keine internationalen Sendungen aus China.
fr: Les comptes transporteurs de test gratuits de Shippo ne prennent pas en charge les expéditions internationales depuis la Chine.
it: Gli account corriere di test gratuiti di Shippo non supportano spedizioni internazionali dalla Cina.
pt: As contas de transportadora de teste gratuitas do Shippo não suportam envios internacionais da China.
zh: Shippo 的免费测试承运商账户不支持来自中国的国际货运。

# shippoHowToGetRealQuotes
source: How to get real shipping quotes:
de: So erhalten Sie echte Versandangebote:
fr: Comment obtenir de vrais devis d'expédition :
it: Come ottenere preventivi di spedizione reali:
pt: Como obter cotações de envio reais:
zh: 如何获取真实运费报价：
